Revit 2024 API
Application.GetFailureDefinitionRegistry Method
 Returns the instance of FailureDefinitionRegistry.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
Visual Basic
Public Shared Function GetFailureDefinitionRegistry As FailureDefinitionRegistry
Visual C++
public:
static FailureDefinitionRegistry^ GetFailureDefinitionRegistry()
Return Value
 The instance of FailureDefinitionRegistry.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace